
import task01

# Головне меню домашки для перевикористання
main_menu = '''1. Кількість днів від заданої дати
2.
3.
4.'''

# Перший вивід головного меню
print(main_menu)

# Повторюємо виконання вічність, або поки користовач не благатиме про вихід
while True:
    action = input('Введіть номер завдання, що необхідно запустити або \'please let me out\' для виходу: ')

    match action:
        case '1':
            # Користувач обрав перше завдання
            str_date = input('Введіть будь-яку дату у форматі РРРР-ММ-ДД: ')

            result = task01.get_days_from_today(str_date)

            if result != 'error':
                print(f'\nРізниця у днях між вказаною датою та сьогодні: {result}\n')
        case '2':
            # Користувач обрав друге завдання
            print('Не вгадав')
        case '3':
            # Користувач обрав третє завдання
            print('Не вгадав')
        case '4':
            # Користувач обрав четверте завдання
            print('Не вгадав')
        case 'please let me out':
            # Користувач обрав вихід. Перериваємо вічний цикл
            break
        case _:
            # Обробка помилкового введення
            print('Не вірно. Спрбуйте ще')

    # Не виводитимо меню одразу, щоб користувачеві було зручно подивитися результати виконнання завдання
    input("Тисніть Enter щоб продовжити...")
    
    # Знову меню
    print(main_menu)